{
  "_name_or_path": "microsoft/deberta-base",
  "architectures": [
    "DebertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-INDICATOR",
    "2": "I-INDICATOR",
    "3": "B-VALUE",
    "4": "I-VALUE",
    "5": "B-UNIT",
    "6": "I-UNIT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-INDICATOR": 1,
    "B-UNIT": 5,
    "B-VALUE": 3,
    "I-INDICATOR": 2,
    "I-UNIT": 6,
    "I-VALUE": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "c2p",
    "p2c"
  ],
  "position_biased_input": false,
  "relative_attention": true,
  "torch_dtype": "float32",
  "transformers_version": "4.24.0",
  "type_vocab_size": 0,
  "vocab_size": 50265
}
